# VRFLoopId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ZoneEquipmentData..::..VRFLoopId Property
ZoneEquipmentData Class See Also
---
The Varible Refrigerant Flow loop for the VRF fan coil equipment type.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public ElementId VRFLoopId { get; set; }
```

Visual Basic
---
```text
Public Property VRFLoopId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ VRFLoopId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace